#### BuiltInFailures.WorksharingFailures Members

---

|  |
| --- |
| BuiltInFailures WorksharingFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures WorksharingFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | DuplicateNamesChanged | These elements' names were automatically changed to eliminate duplicates. |
| Public property Static member | MissingUpdaterLatestOrCentralPlural | The file [File Name] you are trying to synchronize was modified by the third-party updaters [Updater Name(s)] which are not currently installed. \n\r \n\r If you continue to Synchronize with Central or Reload Latest, data maintained by these updaters will not be updated properly. This may create problems when [File Name] is later opened when [Updater Name(s)] are present. |
| Public property Static member | MissingUpdaterLatestOrCentralSingular | The file [File Name] you are trying to synchronize was modified by the third-party updater [Updater Name(s)] which is not currently installed. \n\r \n\r If you continue to Synchronize with Central or Reload Latest, data maintained by this updater will not be updated properly. This may create problems when [File Name] is later opened when [Updater Name(s)] is present. |
| Public property Static member | SeriousElementReferenceCorruption | Element references are seriously corrupt. |

# See Also

BuiltInFailures WorksharingFailures Class

Autodesk.Revit.DB Namespace